#include "game/game.h"
#include <stdio.h>

typedef struct _Work
{
    GV_ACT  actor;           /* 0x000 */
    void   *field_20;        /* 0x020 */
    void   *field_24;        /* 0x024 */
    void   *field_28;        /* 0x028 */
    void   *field_2C;        /* 0x02C */
    void   *field_30;        /* 0x030 */
    char    pad_34[0x84 - 0x34];  /* 0x034 */
    POLY_FT4 field_84;            /* 0x084 */
    char    pad_AC[0x28C - 0xAC]; /* 0x0AC */
    POLY_FT4 field_28C[291];      /* 0x28C */
    char    pad_3004[0xA588 - 0x3004]; /* 0x3004 */
    int     field_A588;                /* 0xA588 */
    char    pad_A58C[0xA595 - 0xA58C]; /* 0xA58C */
    unsigned char field_A595;          /* 0xA595 */
    char    pad_A596[0xA597 - 0xA596]; /* 0xA596 */
    unsigned char field_A597[0xA9A7 - 0xA597]; /* 0xA597 */
    unsigned char field_A9A7[0xA9B6 - 0xA9A7]; /* 0xA9A7 */
    unsigned char field_A9B6[0xAD00 - 0xA9B6]; /* 0xA9B6 */
    GV_PAD *field_AD00;      /* 0xAD00 */
    int     field_AD04;      /* 0xAD04 */
    void   *field_AD08;      /* 0xAD08 */
    int    *field_AD0C;      /* 0xAD0C */
    int     field_AD10;      /* 0xAD10 */
    int     field_AD14;      /* 0xAD14 */
    int    *field_AD18;      /* 0xAD18 */
    void  **field_AD1C;      /* 0xAD1C */
    int     field_AD20;      /* 0xAD20 */
    char    pad_AD24[0x4];   /* 0xAD24 */
    int     field_AD28;      /* 0xAD28 */
    int     field_AD2C;      /* 0xAD2C */
    int     field_AD30;      /* 0xAD30 */
    int     field_AD34;      /* 0xAD34 */
    int     field_AD38;      /* 0xAD38 */
    int     field_AD3C;      /* 0xAD3C */
    int     field_AD40;      /* 0xAD40 */
    int     field_AD44;      /* 0xAD44 */
    int     field_AD48;      /* 0xAD48 */
    char    pad_AD4C[0x4];   /* 0xAD4C */
    int     field_AD50;      /* 0xAD50 */
    int     field_AD54;      /* 0xAD54 */
    int     field_AD58;      /* 0xAD58 */
    int     field_AD5C;      /* 0xAD5C */
    int     field_AD60;      /* 0xAD60 */
    char    pad_AD64[0x10];  /* 0xAD64 */
    int     field_AD74;      /* 0xAD74 */
    int     field_AD78;      /* 0xAD78 */
    int     field_AD7C;      /* 0xAD7C */
    int     field_AD80;      /* 0xAD80 */
    int     field_AD84;      /* 0xAD84 */
    int     field_AD88;      /* 0xAD88 */
    char    pad_AD8C[0x4];   /* 0xAD8C */
    int     field_AD90;      /* 0xAD90 */
    int     field_AD94;      /* 0xAD94 */
    char    pad_AD98[0x4];   /* 0xAD98 */
    int     field_AD9C;      /* 0xAD9C */
    int     field_ADA0;      /* 0xADA0 */
    int     field_ADA4;      /* 0xADA4 */
    int     field_ADA8;      /* 0xADA8 */
    int     field_ADAC;      /* 0xADAC */
    int     field_ADB0;      /* 0xADB0 */
    char    pad_ADB4[0x4];   /* 0xADB4 */
    int     field_ADB8;      /* 0xADB8 */
    int     field_ADBC;      /* 0xADBC */
    int     field_ADC0;      /* 0xADC0 */
    char    field_ADC4;      /* 0xADC4 */
    char    pad_ADC5[0x3];   /* 0xADC5 */
} Work;

typedef struct
{
    short field_0;
    short field_2;
} BrfKeyframe;

typedef struct
{
    char    pad_0[4];
    u_short field_4;  /* tpage */
    u_short field_6;  /* clut */
    u_char  field_8;  /* u */
    u_char  field_9;  /* v */
    u_char  field_A;  /* w */
    u_char  field_B;  /* h */
} BrfGlyph;
BrfGlyph *brf_800CABF4();
extern char brf_dword_800E1BF0[];

BrfGlyph *brf_800CABF4(work, key)
Work *work;
int key;
{
    int i;
    int found = 0;
    for (i = 0; i < work->field_AD10; i++)
    {
        if (work->field_AD0C[i] == key)
        {
            return (BrfGlyph *)((char *)work->field_AD08 + i * 12);
        }
    }
    if (!found)
    {
        printf(brf_dword_800E1BF0, key);
    }
    return 0;
}
void brf_800CAC7C(Work *work, int key)
{
    int i;
    int found = 0;
    void *result = 0;
    for (i = 0; i < work->field_AD14; i++)
    {
        if (work->field_AD18[i] == key)
        {
