#include "game/game.h"
#include "libgcl/libgcl.h"
#include "font/font.h"
#include "libfs/libfs.h"
#include "mts/mts.h"

#include <stdio.h>

typedef struct _Unknown2
{
    short x, y;
    int   color;
} Unknown2;

typedef struct _Unknown
{
    SPRT  text_sprt[2];
    SPRT  text_sprt_outline[2][4];
    SPRT  text_sprt2[2];
    SPRT  text_sprt_outline2[2][4];
    SPRT  text_sprt3[2];
    SPRT  text_sprt4[2];
    /* +0x1E0 */ char *string;
    /* +0x1E4 */ short num;
    /* +0x1E6 */ short num2;
    /* +0x1E8 */ RECT  rect;
    /* +0x1F0 */ short unk1;
    /* +0x1F2 */ short unk2;
    /* +0x1F4 */ short x0;
    /* +0x1F6 */ short y0;
    /* +0x1F8 */ short cx;
    /* +0x1FA */ short cy;
    /* +0x1FC */ short unk3;
    /* +0x1FE */ short unk4;
    /* +0x200 */ short x1;
    /* +0x202 */ short y1;
} Unknown;

typedef struct _Work
{
    /* +0x0000 */ GV_ACT   actor;
    /* +0x0020 */ int      end_proc;
    /* +0x0024 */ int      field_24;
    /* +0x0028 */ GV_PAD  *pad;
    /* +0x002C */ DG_PRIM *prim1;
    /* +0x0030 */ DG_PRIM *prim2;
    /* +0x0034 */ POLY_FT4 polys1[8];
    /* +0x0174 */ POLY_FT4 polys2[9];
    /* +0x02DC */ int      attrs1[8];
    /* +0x02FC */ int      attrs2[9];
    /* +0x0320 */ int      field_320;
    /* +0x0324 */ KCB      kcb[24];
    /* +0x0744 */ char     pad_744[0x758 - 0x744];
    /* +0x0758 */ DR_TPAGE tpage[12];
    /* +0x07B8 */ Unknown  field_7B8[12];
    /* +0x1FE8 */ char     pad_1FE8[0x3818 - 0x1FE8];
    /* +0x3818 */ int      font_x;
    /* +0x381C */ int      font_y;
    /* +0x3820 */ int      clut_x;
    /* +0x3824 */ int      clut_y;
    /* +0x3828 */ int      field_3828;
    /* +0x382C */ char     pad_382C[0x3830 - 0x382C];
    /* +0x3830 */ int      field_3830;
    /* +0x3834 */ int      field_3834;
    /* +0x3838 */ char     pad_3838[0x3858 - 0x3838];
    /* +0x3858 */ MenuPrim primbuf;
    /* +0x386C */ char     field_386C[0x2000];
    /* +0x586C */ char     field_586C[0x2000];
    /* +0x786C */ int      field_786C;
    /* +0x7870 */ int      field_7870;
    /* +0x7874 */ int      field_7874;
    /* +0x7878 */ int      field_7878;
    /* +0x787C */ int      field_787C;
    /* +0x7880 */ char     pad_7880[0x7884 - 0x7880];
} Work;

typedef struct _AbstRes
{
    int id;
    int file;
    int size;
} AbstRes;

extern int abst_dword_800C3CD0;
extern signed char abst_dword_800C3D48[];
extern AbstRes abst_dword_800C3D50[];
extern const char abst_dword_800CE8B4[];
extern const char abst_dword_800CE8B8[];
extern const char abst_dword_800CE8F4[];
extern const char abst_dword_800CE910[];
extern const char abst_dword_800CE928[];
extern const char abst_dword_800CE940[];
extern const char abst_dword_800CE94C[];
extern const char abst_dword_800CE958[];
extern const char abst_dword_800CE964[];
extern const char abst_dword_800CE970[];
extern const char abst_dword_800CE97C[];
extern const char abst_dword_800CE988[];
extern const char abst_dword_800CE990[];
extern const char abst_dword_800CE998[];
extern const char abst_dword_800CE9A0[];
extern const char abst_dword_800CE9A8[];
extern const char abst_dword_800CE9B0[];
extern const char abst_dword_800CE9B8[];
