#include "game/game.h"
#include "libgcl/libgcl.h"

#include <stdio.h>

// FIXME: it's the same struct as in change.c (in change overlay)
typedef struct _Unknown
{
    SPRT  text_sprt[2];
    SPRT  text_sprt_outline[2][4];
    SPRT  text_sprt2[2];
    SPRT  text_sprt_outline2[2][4];
    SPRT  text_sprt3[2];
    SPRT  text_sprt4[2];
    char *string;
    short num;
    short num2;
    RECT  rect;
    short unk1;
    short unk2;
    short x0;
    short y0;
    short cx;
    short cy;
    short unk3;
    short unk4;
    short x1;
    short y1;
} Unknown;

// FIXME: it's the same struct (but without num) as in preope.c (in preope overlay)
typedef struct _Unknown2
{
    short x, y;
    int   color;
} Unknown2;

typedef struct _Work
{
    /* +0x0000 */ GV_ACT   actor;
    /* +0x0020 */ int      end_proc;
    /* +0x0024 */ GV_PAD  *pad;
    /* +0x0028 */ DG_PRIM *prim1;
    /* +0x002C */ DG_PRIM *prim2;
    /* +0x0030 */ POLY_FT4 polys1[6];
    /* +0x0120 */ POLY_FT4 polys2[9];
    /* +0x0288 */ int      attrs1[6]; /* new name needed */
    /* +0x02A0 */ int      attrs2[9]; /* new name needed */
    /* +0x02C4 */ int      field_2C4;
    /* +0x02C8 */ KCB      kcb[12];
    /* +0x04D8 */ char     pad1[0x14];
    /* +0x04EC */ DR_TPAGE tpage[6];
    /* +0x051C */ Unknown  field_51C[12];
    /* +0x1D4C */ int      font_x;
    /* +0x1D50 */ int      font_y;
    /* +0x1D54 */ int      clut_x;
    /* +0x1D58 */ int      clut_y;
    /* +0x1D5C */ int      field_1D5C;
    /* +0x1D60 */ char     pad3[0x4];
    /* +0x1D64 */ int      field_1D64;
    /* +0x1D68 */ int      field_1D68;
    /* +0x1D6C */ char     pad4[0x20];
    /* +0x1D8C */ MenuPrim primbuf;
    /* +0x1DA0 */ char     field_1DA0[0x2000];
    /* +0x3DA0 */ char     field_3DA0[0x2000];
    /* +0x5DA0 */ int      field_5DA0;
    /* +0x5DA4 */ int      field_5DA4;
} Work;

Unknown2 D_800C3238[] =
{
    {88, 0x00B4, 0x6739},
    {16, 0x0023, 0},
    {16, 0x0036, 0},
    {16, 0x0049, 0},
    {16, 0x005C, 0},
    {16, 0x006F, 0},
    {16, 0x0082, 0},
    {16, 0x0095, 0},
    {16, 0x00A8, 0},
    {16, 0x00BB, 0},
    {16, 0x00CE, 0},
    {16, 0x00E1, 0},
};

signed char D_800C3298[] = {-1, 0, 1, 0, 0, 1, 0, -1};

void func_800C464C(Work *work, int index)
{
    RECT  rect;
    KCB  *kcb;
    void *buf;

    kcb = &work->kcb[index];
    
    rect.x = work->font_x;
    rect.y = work->font_y;
    rect.w = 128;
    rect.h = 21;
    
    work->field_51C[index].x0 = work->font_x;
    work->field_51C[index].y0 = work->font_y;

    work->field_51C[index].x1 = work->font_x + 64;
    work->field_51C[index].y1 = work->font_y;
    work->font_y += 21;

    font_init_kcb(kcb, &rect, work->clut_x, work->clut_y);
    
    work->field_51C[index].cx = work->clut_x;
    work->field_51C[index].cy = work->clut_y;
