#include "game/game.h"
#include "game/target.h"
#include "kojo/m1e1.h"
#include "libgcl/libgcl.h"
#include "libhzd/libhzd.h"
#include "libdg/libdg.h"
#include "linkvar.h"

extern int rand(void);
extern void *NewFadeInOut(int mode, int shade);
extern void *NewSmokeLn_800CDFA4(int a0, int a1, int a2, SVECTOR *p, SVECTOR *q,
                                 SVECTOR *r, char b, char c, char d);
extern void AN_Blast_high2(SVECTOR *pos, SVECTOR *offset);

typedef struct
{
    HZD_SEG seg[4];
    HZD_FLR flr[2];
} HzdBlock; /* 0xA0 */

typedef struct _Work
{
    char     pad_000[0x20];
    CONTROL  control;       /* 0x020 (mov@0x20, map@0x4C, turn@0x6C) */
    char     pad_9C[0xDC - 0x9C];
    OBJECT   body;          /* 0x0DC */
    OBJECT   bodies_a[3];   /* 0x1C0 */
    OBJECT   bodies_b[3];   /* 0x46C */
    void    *field_718[10]; /* 0x718 */
    int      field_740;     /* 0x740 */
    char     pad_744[0x74C - 0x744];
    char     snap_control[0x7C];   /* 0x74C */
    char     snap_body[0xE4];      /* 0x7C8 */
    char     pad_8AC[0x8BC - 0x8AC];
    int      field_8BC;     /* 0x8BC */
    char     pad_8C0[0x8CC - 0x8C0];
    TARGET   target0;       /* 0x8CC */
    TARGET   target1;       /* 0x914 */
    char     pad_95C[0x960 - 0x95C];
    TARGET   target2;       /* 0x960 */
    TARGET   target3;       /* 0x9A8 */
    TARGET   target4;       /* 0x9F0 */
    TARGET   target5;       /* 0xA38 */
    char     pad_A80[0xA84 - 0xA80];
    TARGET   field_A84[10]; /* 0xA84 */
    int      field_D54;     /* 0xD54 */
    int      field_D58;     /* 0xD58 */
    int      field_D5C;
    int      field_D60;
    int      field_D64;     /* 0xD64 */
    int      field_D68;     /* 0xD68 */
    int      field_D6C;
    int      field_D70;
    int      field_D74;
    int      field_D78;
    int      field_D7C;
    int      field_D80;
    int      field_D84;
    int      field_D88;
    int      field_D8C;
    int      field_D90;
    int      field_D94;
    int      field_D98;
    int      field_D9C;
    int      field_DA0;
    int      field_DA4;
    int      field_DA8;
    int      field_DAC;
    int      field_DB0;
    int      field_DB4;
    int      field_DB8;
    char     pad_DBC[0xDC4 - 0xDBC];
    int      field_DC4;
    char     pad_DC8[0xE08 - 0xDC8];
    int      field_E08;     /* 0xE08 */
    int      field_E0C;     /* 0xE0C */
    int      field_E10;     /* 0xE10 */
    char     pad_E14[0xE14 - 0xE14];
    int      field_E14;
    char     pad_E18[0xE1C - 0xE18];
    int      field_E1C;     /* 0xE1C */
    int      field_E20;     /* 0xE20 */
    char     pad_E24[0xE24 - 0xE24];
    int      field_E24;
    int      field_E28;
    char     pad_E2C[0xE2C - 0xE2C];
    int      field_E2C;
    int      field_E30;
    char     pad_E34[0xE34 - 0xE34];
    int      field_E34;
    char     pad_E38[0xE3C - 0xE38];
    int      field_E3C;
    char     pad_E40[0xE44 - 0xE40];
    int      field_E44;
    int      field_E48;
    int      field_E4C;
    char     pad_E50[0xE54 - 0xE50];
    u_short  field_E54;     /* 0xE54 */
    u_short  field_E56;     /* 0xE56 */
    u_short  field_E58;     /* 0xE58 */
    char     pad_E5A[0xE5C - 0xE5A];
    int      field_E5C;
    int      field_E60;
    int      field_E64;     /* 0xE64 */
    int      field_E68;
    char     pad_E6C[0xE88 - 0xE6C];
    int      field_E88;
    char     pad_E8C[0xE9C - 0xE8C];
    u_short  field_E9C;     /* 0xE9C */
    short    field_E9E;     /* 0xE9E */
    u_short  field_EA0;     /* 0xEA0 */
    char     pad_EA2[0xEA4 - 0xEA2];
    short    field_EA4;     /* 0xEA4 */
    char     pad_EA6[0xEB0 - 0xEA6];
    void    *field_EB0;     /* 0xEB0 */
    char     pad_EB4[0xEC0 - 0xEB4];
    int      field_EC0;     /* 0xEC0 */
    int      field_EC4;
    int      field_EC8;
    char     pad_ECC[0xED0 - 0xECC];
    int      field_ED0;     /* 0xED0 */
    char     pad_ED4[0xED8 - 0xED4];
    int      field_ED8;
    void    *field_EDC;     /* 0xEDC */
    char     pad_EE0[0xEF0 - 0xEE0];
    SVECTOR  field_EF0[10]; /* 0xEF0 */
    char     pad_F40[0xF40 - 0xF40];
    int      field_F40;     /* 0xF40 */
    int      field_F44;
    int      field_F48;
    int      field_F4C;
    int      field_F50;
    int      field_F54;
    int      field_F58;     /* 0xF58 */
    int      field_F5C;
    int      field_F60;
    int      field_F64;
    int      field_F68;
    int      field_F6C;
    int      field_F70;
    int      field_F74;
    int      field_F78;
    char     pad_F7C[0xF80 - 0xF7C];
    int      field_F80;
    char     pad_F84[0xF88 - 0xF84];
    int      field_F88;
    SVECTOR  bbox[10];      /* 0xF8C */
    char     pad_FDC[0xFEC - 0xFDC];
    HzdBlock hzd[5];        /* 0xFEC */
    HZD_FLR  copy0;         /* 0x130C */
    HZD_FLR  copy1;         /* 0x133C */
    HZD_FLR  copy2;         /* 0x136C */
} Work;

extern Work *s05a_dword_800C362C;
extern int   s05a_dword_800C3630;
extern int   s05a_dword_800C3634;
extern int   s05a_dword_800C3638;

extern void sub_8007E1C0(HZD_SEG *seg, HZD_FLR *flr, MATRIX *pTransform,
                         SVECTOR *pMin, SVECTOR *pMax);
extern void AN_Smoke_800CE08C(SVECTOR *pos);

void  s05a_800D627C(Work *work);
void  s05a_800D797C(Work *work);
void  s05a_800D863C(Work *work);
void  s05a_800D9754(Work *work);
void  s05a_800DA02C(Work *work);
void  s05a_800DA62C(Work *work);
void  s05a_800DA940(Work *work);
void  s05a_800DACF0(Work *work);
void  s05a_800DD1C8(Work *work);

void s05a_800D4A74(Work *work)
{
    SVECTOR va;         /* sp+0x28 */
    SVECTOR vb;         /* sp+0x30 */
    SVECTOR vc;         /* sp+0x38 */
    int     i;
    int     s0;
    OBJECT *bodyp;

    MENU_Locate(0x50, 0x5a, 0);

    /* control + light-matrix snapshot */
    memcpy(work->snap_control, &work->control, 0x7C);
