#include "common.h"
#include "linkvar.h"
#include "chara/snake/sna_init.h"
#include "game/game.h"
#include "game/jimctrl.h"
#include "libdg/libdg.h"
#include "libgcl/libgcl.h"
#include "libgv/libgv.h"
#include "menu/menuman.h"
#include "mts/mts.h" // for fprintf

#include <stdio.h>

struct _Work;
typedef void (*NinjaFunc)(struct _Work *);

typedef struct _NinjaClone
{
    int     field_0;
    SVECTOR field_4[32];
} NinjaClone;

typedef struct _Work
{
    GV_ACT         actor;       /* 0x000 */
    CONTROL        control;     /* 0x020 */
    OBJECT         body;        /* 0x09C */
    MOTION_CONTROL m_ctrl;      /* 0x180 */
    MOTION_SEGMENT m_segs1[17]; /* 0x1D0 */
    MOTION_SEGMENT m_segs2[17]; /* 0x434 */
    SVECTOR        rots[16];    /* 0x698 */
    SVECTOR        adjust[16];  /* 0x718 */
    MATRIX         light[2];    /* 0x798 */
    int            field_7D8;   /* 0x7D8 */
    OBJECT         weapon;      /* 0x7DC */
    int            field_8C0;   /* 0x8C0 */
    TARGET        *target;      /* 0x8C4 */

    char      pad_910[0x910 - 0x8C4 - sizeof(TARGET *)];
    HOMING   *field_910;   /* 0x910 */
    char       pad_920[0x920 - 0x910 - sizeof(HOMING *)];
    NinjaClone clones[11];  /* 0x920 */
    char       pad_1964[0x1964 - 0x920 - 11 * sizeof(NinjaClone)];
    short      field_1964;  /* 0x1964 */
    short      field_1966;  /* 0x1966 */
    SVECTOR   field_1968;  /* 0x1968 */
    int       field_1970;  /* 0x1970 */
    int       field_1974;  // 0x1974
    int       field_1978;  // 0x1978
    int       field_197C;  // 0x197C
    SVECTOR   field_1980;  // 0x1980
    int       field_1988;  // 0x1988
    SVECTOR   field_198C;  // 0x198C
    char      pad_19A4[0x19A4 - 0x198C - sizeof(SVECTOR)];
    int       field_19A4;  /* 0x19A4 */
    int       field_19A8;  /* 0x19A8 */
    int       field_19AC;  /* 0x19AC */
    int       field_19B0;  /* 0x19B0 */
    int       field_19B4;  /* 0x19B4 */
    int       field_19B8;  /* 0x19B8 */
    void     *field_19BC;  /* 0x19BC */
    int       field_19C0;  /* 0x19C0 */
    int       field_19C4;  /* 0x19C4 */
    int       field_19C8;  /* 0x19C8 */
    int       field_19CC;  /* 0x19CC */
    int       field_19D0;  /* 0x19D0 */
    int       field_19D4;  /* 0x19D4 */
    int       field_19D8;  /* 0x19D8 */
    int       field_19DC;  /* 0x19DC */
    int       field_19E0;  /* 0x19E0 */
    int       field_19E4;  /* 0x19E4 */
    char      pad_19F0[0x19F0 - 0x19E4 - 4];
    int       field_19F0;  /* 0x19F0 */
    int       field_19F4;  /* 0x19F4 */
    int       field_19F8;  /* 0x19F8 */
    char      pad_1A00[0x1A00 - 0x19F8 - 4];
    int       field_1A00;  /* 0x1A00 */
    int       field_1A04;  /* 0x1A04 */
    int       field_1A08;  /* 0x1A08 */
    int       field_1A0C;  /* 0x1A0C */
    char      pad_1A14[0x1A14 - 0x1A0C - sizeof(int)];
    int       field_1A14;  /* 0x1A14 */
    char      pad_1A20[0x1A20 - 0x1A14 - sizeof(int)];
    void     *field_1A20;  /* 0x1A20 */
    void     *field_1A24;  /* 0x1A24 */
    int       field_1A28;     // 0x1A28
    int       field_1A2C;     // 0x1A2C
    char      pad_1A30[0x4]; /* 0x1A28 */
    int       field_1A34;     /* 0x1A34 */
    int       field_1A38;     /* 0x1A38 */
    char      pad_1A40[0x4]; /* 0x1A3C */
    NinjaFunc field_1A40[8];  /* 0x1A40 */
    char      pad_1A80[0x1A80 - 0x1A60];
    DG_PRIM  *field_1A80;  /* 0x1A80 */
    char      pad_1A8C[0x1A8C - 0x1A84];
    int       field_1A8C;  /* 0x1A8C */
    int       field_1A90;  /* 0x1A90 */
    int       field_1A94;  /* 0x1A94 */
    int       field_1A98[0x23]; /* 0x1A98 */
    short     field_1B24;  /* 0x1B24 */
    char      pad_1B28[0x1B28 - 0x1B24 - sizeof(short)];
    short     field_1B28;  /* 0x1B28 */
    char      pad_1B34[0x1B34 - 0x1B28 - sizeof(short)];
} Work;

/* forward declarations for helpers called by the migrated functions */
extern int   s08b_bunsin2_800C9978(OBJECT *body);
extern void  s08b_bunsin2_800CDE74(Work *work);
extern void  s08b_bunsin2_800CE0A4(void);
extern void  s08b_bunsin2_800CE180(Work *work);
extern int   s08b_bunsin2_800CE584(Work *work);
extern void  s08b_bunsin2_800CE800(Work *work, int arg);
extern int   s08b_bunsin2_800CE8A0(Work *work);
extern void  s08b_bunsin2_800CEB40(Work *work);
extern int   s08b_bunsin2_800CF150(Work *work);
extern int   s08b_bunsin2_800CF354(Work *work);
extern void  s08b_bunsin2_800CF660(Work *work);
extern int   s08b_bunsin2_800CFB98(Work *work);
extern int   s08b_bunsin2_800D0078(Work *work);
extern int   s08b_bunsin2_800D0550(Work *work);
extern void  s08b_bunsin2_800D0B4C(Work *work);
extern void  s08b_bunsin2_800D1F9C(Work *work);
extern void  s08b_bunsin2_800D2BFC(Work *work);
