#include "common.h"
#include "linkvar.h"
#include "chara/snake/shadow.h"
#include "game/game.h"
#include "game/vibrate.h"
#include "libgcl/libgcl.h"
#include "okajima/blood.h"

#define BODY_FLAG   ( DG_FLAG_TEXT | DG_FLAG_TRANS | DG_FLAG_SHADE | DG_FLAG_GBOUND | DG_FLAG_AMBIENT | DG_FLAG_IRTEXTURE )
#define BODY_DATA   GV_StrCode( "sne_nude" )
#define BODY_DATA2  GV_StrCode( "ippanhei" )
#define MOTION_DATA GV_StrCode( d18a_aSnevs_800DA744 )

typedef struct _Snake18Type
{
    char *str;
    char *str2;
    char *field_08;
    char *field_0C;
    char *field_10;
    char  pad_18[0x18 - 0x10 - sizeof(char *)];
    char *field_18;
} Snake18Type;

typedef struct _Snake18Init
{
    char    pad_4[4];
    short   f4;          // 0x8C8 in Snake18Work
    char    pad_8[2];
    short   f8;          // 0x8CC
    char    pad_C[2];
    short   fC;          // 0x8D0
    char    pad_E[6];
} Snake18Init;

typedef struct _Snake18Work
{
    GV_ACT         actor;         // 0x000
    CONTROL        control;       // 0x020
    OBJECT         body;          // 0x09C
    MOTION_CONTROL m_ctrl;        // 0x180
    MOTION_SEGMENT m_segs1[17];   // 0x1D0
    MOTION_SEGMENT m_segs2[17];   // 0x434
    SVECTOR        rots[16];      // 0x698
    char           pad_718[0x728 - 0x718];
    short          f728;          // 0x728
    char           pad_72A[0x748 - 0x728 - sizeof(short)];
    short          f748;          // 0x748
    char           pad_74A[0x750 - 0x748 - sizeof(short)];
    short          f750;          // 0x750
    char           pad_752[0x79C - 0x750 - sizeof(short)];
    MATRIX         light[2];      // 0x79C
    void          *shadow;        // 0x7DC
    int           *enable_shadow; // 0x7E0

    int     f7E4;        // 0x7E4
    short  *f7E8;        // 0x7E8 (pointer slot, used by 800CC8E0 etc.)
    TARGET  f7EC;        // 0x7EC
    char    pad_834[0x834 - 0x7EC - sizeof(TARGET)];
    int     f834;        // 0x834
    char    pad_840[0x840 - 0x834 - sizeof(int)];
    int     f840;        // 0x840
    char    pad_848[0x848 - 0x840 - sizeof(int)];
    SVECTOR f848;        // 0x848
    char    pad_854[0x854 - 0x848 - sizeof(SVECTOR)];
    int     f854;        // 0x854
    int     f858;        // 0x858
    int     f85C;        // 0x85C
    short  *f860;        // 0x860
    int     f864;        // 0x864
    char    pad_868[0x868 - 0x864 - sizeof(int)];
    int     f868;        // 0x868
    short   f86C;        // 0x86C
    short   f86E;        // 0x86E
    char    pad_8A4[0x8A4 - 0x86E - sizeof(short)];
    GV_PAD *pad;         // 0x8A4
    Snake18Type *f8A8;   // 0x8A8
    void   *f8AC;        // 0x8AC (callback pointer)
    int     f8B0;        // 0x8B0
    void   *f8B4;        // 0x8B4 (callback pointer)
    int     f8B8;        // 0x8B8
    void   *f8BC;        // 0x8BC (callback pointer)
    void   *f8C0;        // 0x8C0 (callback pointer)
    Snake18Init f8C4;    // 0x8C4 (20-byte init block; .f4=0x8C8 .f8=0x8CC .fC=0x8D0)
    char    pad_8F0[0x8F0 - 0x8C4 - sizeof(Snake18Init)];
    int     f8F0;        // 0x8F0
    int     f8F4;        // 0x8F4
    short   f8F8;        // 0x8F8
    char    pad_8FC[0x8FC - 0x8F8 - sizeof(short)];
    char    f8FC;        // 0x8FC
    char    pad_8FE[0x8FE - 0x8FC - sizeof(char)];
    short   f8FE;        // 0x8FE
    short   f900;        // 0x900
    short   f902;        // 0x902
    char    pad_906[0x906 - 0x902 - sizeof(short)];
    short   f906;        // 0x906
    char    pad_90C[0x90C - 0x906 - sizeof(short)];
    char    f90C;        // 0x90C
    char    f90D;        // 0x90D
    char    f90E;        // 0x90E
    char    pad_910[0x910 - 0x90E - sizeof(char)];
    short   f910;        // 0x910
    short   f912;        // 0x912
    char    pad_91C[0x91C - 0x912 - sizeof(short)];
    SVECTOR f91C;        // 0x91C (saved control.mov)
    char    pad_924[0x924 - 0x91C - sizeof(SVECTOR)];
    short   f924;        // 0x924
    short   f926;        // 0x926
    char    pad_92E[0x92E - 0x926 - sizeof(short)];
    short   f92E;        // 0x92E
    int     f930;        // 0x930
} Snake18Work;

typedef struct _Snake18Arg9CC
{
    SVECTOR f0;
    SVECTOR f8;
    SVECTOR f10;
    int     f18;
    int     f1C;
} Snake18Arg9CC;

extern GM_CameraSystemWork GM_Camera;

extern short    d18a_dword_800C37E0;
extern short    d18a_dword_800C37F8;
extern SVECTOR  d18a_dword_800C3850;
extern SVECTOR  d18a_dword_800C3858;
extern char     d18a_dword_800C3860[];
extern char     d18a_dword_800C3864[];
extern int      d18a_dword_800DAEF0;
extern int      d18a_dword_800DAEF4;
extern char    *d18a_dword_800DAEFC;
extern HZD_FLR *d18a_dword_800DAF00[2];
extern HZD_FLR *d18a_dword_800DAF10;

extern const char d18a_aSnevs_800DA744[]; // = "sne_18vs"

int  d18a_snake18_800CAEC0(Snake18Work *work, int state);
void d18a_snake18_800CB2EC(Snake18Work *work);
int  d18a_snake18_800CB710(Snake18Work *work, int a1);
void d18a_snake18_800CDFC8(void);
void d18a_snake18_800CE210(void);
void d18a_snake18_800CE7BC(void);
